{
  "1": {
    "HF0154": {
      "nome": "Seminário de Integração e Introdução à Universidade e ao Curso de Psicologia",
      "ementa": "A UFC: estrutura administrativa e acadêmica, equipamentos. O Curso de Psicologia: estrutura curricular, corpo docente, núcleos de pesquisa e extensão e laboratórios. A pós-graduação em Psicologia.",
      "carga": "16 hrs",
      "creditos": "01",
      "pre": [],
    },
    "HF0901": {
      "nome": "Introdução à Filosofia",
      "ementa": "Compreensão da singularidade do saber filosófico em relação aos demais saberes (religioso e científico). Enfoque dos seus principais campos (ética, estética, política, lógica, metafísica, epistemologia).",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": [],
    },
    "HF0156": {
      "nome": "Metodologia do trabalho acadêmico",
      "ementa": "Os estudos na Universidade: características e recursos disponíveis. Metodologias de leitura e de pesquisa bibliográfica. Elaboração de textos acadêmicos. Técnicas de apresentação de trabalhos acadêmico-científicos. Normas técnicas de referência e documentação. Sistemas de busca de referências bibliográficas",
      "carga": "32 hrs",
      "creditos": "02",
      "pre": [],
    },
    "PS204": {
      "nome": "Introdução à Sociologia",
      "ementa": "Contextualização histórica do surgimento da Sociologia. A diversidade das perspectivas teórico-metodológicas da análise sociológica. Principais enfoques teóricos: Durkheim, Weber, Marx. Conceitos-chave da Sociologia. Temáticas da Sociologia contemporânea. Algumas reflexões sobre a cultura e a sociedade brasileira.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": [],
    },
    "SF0687": {
      "nome": "Fundamentos de Anatomia para a Psicologia",
      "ementa": "Introdução ao estudo da Anatomia. Divisões. Nômina Anatômica. Ossos: generalidades e esqueleto. Crânio ósseo e coluna vertebral. Tórax e pelve óssea. Sistema articular: generalidades. Sistema nervoso: generalidades, embriogênese e divisões. Morfologia externa da medula espinhal. Morfologia externa do encéfalo. Nervos espinhais e cranianos. Vascularização do SNC, meninges, sistema ventricular e líquor. Sistema nervoso autônomo. Sistema circulatório. Sistema Respiratório. Sistema Digestório. Sistema Urinário. Sistema reprodutor masculino e feminino.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": [],
    },
  },
  
  "2": {
    "HF0157": {
      "nome": "Fundamentos metodológicos das Ciências Humanas",
      "ementa": "Ciência e conhecimento científico. Bases históricas da ciência moderna. O método nas ciências naturais e nas ciências psicossociais. A pesquisa científica em suas dimensões epistemológicas, teóricas, morfológicas e técnicas. Delineamentos quantitativos e qualitativos em Psicologia.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Metodologia do Trabalho acadêmico (HF0156)"],
    },
    "HF0158": {
      "nome": "Teorias e práticas em Psicologia Social I",
      "ementa": "História, conceito e abordagens em Psicologia Social. Categorias psicossociais nas vertentes em psicologia social. A teoria histórico-cultural e seu desdobramento na América Latina. O compromisso ético político do psicólogo social.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Introdução à Psicologia (HF0155)"],
    },
    "HF0162": {
      "nome": "Teorias da Subjetividade IV",
      "ementa": "Psicologia Genética (Piaget e outros): personalidade, sujeito psicológico e sujeito epistêmico, subjetividade e atividade do sujeito, inteligência, consciência e simbolização, egocentrismo, pensamento e linguagem. Psicologia Histórico-Cultural (Vìgotski e outros): pensamento, linguagem e seus eixos interno e externo, a internalização das funções psicológicas superiores, pensamento e palavra, sentido e significado, linguagem monológica e dialógica, linguagem interior, a concepção semiótica da consciência, o sujeito psicológico e seus aspectos lógico e semântico.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Introdução à Filosofia (HD0901)" , "Introdução à Psicologia (HF0155)"],
    },
    "HF0166": {
      "nome": "Teorias da Subjetividade II (Psicanálise e Psicologia Analítica)",
      "ementa": "Da hipnose à associação livre: a origem da psicanálise. A etiologia sexual das neuroses e o conceito de defesa. A interpretação dos sonhos e a formulação do conceito de inconsciente. O sonho e a relização de desejo. O modelo de aparelho psíquico. A teoria da Sexualidade. A metapsicologia freudiana: primeira e segunda tópicas. Édipo e castração. Psicologia analítica.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Introdução à Filosofia (HD0901)" , "Introdução à Psicologia (HF0155)"],
    },
    "HF0160": {
      "nome": "Psicologia do Desenvolvimento I",
      "ementa": "A constituição da Psicologia do desenvolvimento como área de estudo científico. Fases do desenvolvimento no ciclo de vida. O desenvolvimento pré-natal e o processo de nascimento. A gênese do conceito de infância. Concepções sobre adolescência. Articulações entre as diferentes perspectivas teóricas. O desenvolvimento em seus domínios motor, cognitivo, moral, psicossexual e psicossocial. O desenvolvimento atípico.",
      "carga": "96 hrs",
      "creditos": "06",
      "pre": ["Introdução à Psicologia(HF0155)"],
    },
  },

  "3": {
    "HF0163": {
      "nome": "Métodos e Técnicas de Pesquisa Quantitativa",
      "ementa": "Delineamentos experimentais e quase-experimentais; pesquisa ex-post-facto; levantamentos (surveys); noções de amostragem; questionários e escalas, noções de estatística descritiva e inferencial (métodos paramétricos e não-paramétricos). Programas de informática.",
      "carga": "96 hrs",
      "creditos": "06",
      "pre": ["Fundamentos Metodológicos das Ciências Humanas (HF0157)"],
    },
    "HF0164": {
      "nome": "Teorias e práticas em Psicologia Social II",
      "ementa": "Histórico do pensamento psicossocial dos comportamentos coletivos. Conceitos e abordagens teórico-críticas das Psicologias das Massas. Categorias e fenômenos psicossociais das Sociedades contemporâneas. Pesquisa de campo sobre fenômenos coletivos contemporâneos.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Teorias e práticas em Psicologia Social I (HF0158)"],
    },
    "HF0165": {
      "nome": "Teorias da Subjetividade III (Comportamentalismo)",
      "ementa": "Subjetividade enquanto um fenômeno relevante para a Psicologia. O modelo monista para a abordagem da subjetividade. A interpretação behaviorista radical para os eventos privados. As dicotomias privado/público, subjetivo/objetivo, interno/externo e mental/físico. Privacidade e Linguagem. Processos básicos: aprendizagem e memória. Auto-conhecimento. Controle do comportamento por eventos privados. Possibilidades de investigação e intervenção frente aos eventos privados. A análise funcional do comportamento como instrumento de análise da subjetividade.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Introdução à Filosofia (HD901)" , "Introdução à Psicologia (HF0155)"],
    },
    "HF0161": {
      "nome": "Teorias da Subjetividade I (Fenomologia Existencial e Humanismo)",
      "ementa": "Fenomenologias e Psicologias. A psicologia eidética e a subjetividade que visa a essência. A psicologia existencial e a subjetividade como existência. A psicologia humanista e a subjetividade como vivência individual. O sujeito como pessoa na ACP. O sujeito como organismo na GT.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Introdução à Filosofia (HD901)" , "Introdução à Psicologia (HF0155)"],
    },
    "HF0167": {
      "nome": "Psicologia do Desenvolvimento II",
      "ementa": "Teorias psicológicas da vida adulta e da velhice. Mudanças cognitivas e intelectivas no processo de envelhecimento; sexualidade e afetividade na maturidade; mudanças psicossociais na vida adulta e na velhice: relações familiares, sociabilidade, perdas, luto, morte; O Estatuto do Idoso; As práticas psicológicas",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Psicologia do Desenvolvimento I (HF0160)"],
    },
    "HF0174": {
      "nome": "Ética e Psicologia",
      "ementa": "A questão ética e a modernidade. Alteridade e subjetividade. Ética e Psicologia: limites da ciência e abertura da filosofia. Psicologias: conhecimento e aplicação. Responsabilidade social: ética e política.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Introdução à Filosofia (HD901)" , "Introdução à Psicologia (HF0155)"],
    },
  },

  "4": {
    "HF0168": {
      "nome": "Epistemologia e História das Psicologias IV (Piaget e Vygotski)",
      "ementa": "Epistemologia ou teoria do conhecimento, lógica e metodologia. As variedades da epistemologia: metacientífica, paracientífica e científica. Os métodos da epistemologia: a análise direta de Poincaré, a análise formalizante do Positivismo Lógico, o histórico-crítico de Koyré e de Bachelard, a análise logística e a análise histórica da Epistemologia Genética. A dialética, o materialismo dialético e a perspectiva metateórica e metodológica da psicologia Histórico-Cultural.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Teorias da Subjetividade IV (HF0162)"],
    },
    "HF0170": {
      "nome": "Métodos e Técnicas de Pesquisa Qualitativa em Psicologia",
      "ementa": "O qualitativo e o quantitativo nas pesquisas em psicologia: panorama histórico e bases teóricas. Diferentes métodos qualitativos: experimental, fenomenológico, estruturalista e dialético. Tipos de pesquisa qualitativa em Psicologia. Técnicas e procedimentos de coleta e construção do corpus de pesquisa e de análise das informações.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Fundamentos Metodológicos das Ciências Humanas (HF0157)"],
    },
    "HF0171": {
      "nome": "Psicologia Comunitária",
      "ementa": "Origem e história da Psicologia Comunitária; correntes européias, estadounidenses e latino-americana; conceitos básicos; o papel do Psicólogo Comunitário; métodos e técnicas de investigação e de intervenção em Psicologia Comunitária; trabalho de campo.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Teorias e práticas em Psicologia Social II (HF0164)."],
    },
    "HF0180": {
      "nome": "Análise experimental do comportamento",
      "ementa": "Estudo da Análise Experimental do Comportamento, das principais contribuições de Pavlov, Thorndike, Watson e Skinner ao estudo do comportamento e dos principais conceitos derivados desses estudos.",
      "carga": "80 hrs",
      "creditos": "05",
      "pre": ["Epistemologia e História das Psicologias III (HF0169)"],
    },
    "HF0178": {
      "nome": "Psicologia e Saúde Coletiva I",
      "ementa": "Compreensão das atuais políticas de saúde e dos seus processos de formulação, gestão e controle social, articulando com a prática do psicólogo.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Introdução à Psicologia (HF0155)"],
    },
  },

  "5": {
    "HF0169": {
      "nome": "Epistemologia e História das Psicologias III (Comportamentalismo e Funcionalismo)",
      "ementa": "A psicologia norte-americana. Os fundamentos da psicologia comparada: Romanes, Lloyd Morgan, Loeb e Jennings. O pragmatismo: Peirce, James e Dewey. O funcionalismo: Baldwin, Angell e Harvey Carr. O realismo do comportamentismo metodológico: John Broadus Watson. O pragmatismo do comportamentismo radical: Skinner. Os neo-comportamentistas: Tolman e Hull. A concepção da ciência do comportamento: o behaviorismo e a Análise do Comportamento. Os períodos do fieri científico em Skinner.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Teorias da Subjetividade III (HF0 165)"],
    },
    "HF0175": {
      "nome": "Epistemologia e História das Psicologias II (Psicanálise e Psicologia Analítica)",
      "ementa": "Psicanálise: a concepção e os fundamentos da ciência em Freud. O inconsciente. O método. A metapsicologia e suas dimensões: os pontos de vista tópico, dinâmico e econômico. Os períodos do fieri freudiano. O interesse científico da psicanálise. Dissidências: Adler e Jung e releituras: Melanie Klein, Lacan, Winnicot. Psicologia Analítica: a concepção de ciência em Jung. O inconsciente e as funções da consciência. O método. A delimitação do campo psicológico. Os períodos do fieri junguiano. O problema fundamental da psicologia contemporânea a Jung.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Teorias da Subjetividade II (HF0166)"],
    },
    "HF0176": {
      "nome": "Fundamentos de Psicopatologia",
      "ementa": "O surgimento do saber psicopatológico: aspectos históricos, epistemológicos e clínicos. As grandes correntes em psicopatologia e as tendências atuais. Perspectivas diagnósticas.",
      "carga": "96 hrs",
      "creditos": "06",
      "pre": ["Introdução a Psicologia (HF0155)"],
    },
    "HF0224": {
      "nome": "Psicologia da Saúde",
      "ementa": "SEM EMENTA!",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": [],
    },
    "HF0173": {
      "nome": "Psicometria",
      "ementa": "Avaliação psicológica: campo de conhecimento e objetivos. Histórico das medidas em Psicologia. Fundamentos psicométricos: padronização, validade e precisão dos testes psicológicos. Teorias fatorialistas da inteligência e da personalidade. Testes Psicométricos: inteligência geral, aptidões específicas, escalas e inventários.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Métodos e Técnicas de Pesquisa Quantitativa em Psicologia(HF0163)"],
    },
    "HF0179": {
      "nome": "Práticas Integrativas Em Psicologia II",
      "ementa": "Práticas integrativas de competências e habilidades do núcleo comum, supervisionadas e inseridas em um conjunto de atividades que compõem a prática profissional nas seguintes áreas: educacional, comunitária, clínica, hospitalar, social, saúde pública e trabalho.",
      "carga": "80 hrs",
      "creditos": "05",
      "pre": ["Ética e Psicologia (HF0174)" , "Práticas Integrativas Em Psicologia I(HF0172)"],
    },
  },

  "6": {
    "HF0181": {
      "nome": "Epistemologia e História das Psicologias I (Fenomenologia Existencial e Humanismo)",
      "ementa": "Epistemologia e Fenomenologia. O antipsicologismo de Husserl. A analítica de Heidegger. Merleau-Ponty e a filosofia da ambiguidade. O intuicionismo de Bergson. O conhecimento psicológico de matriz fenomenológica.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Teorias da Subjetividade I (HF0161)"],
    },
    "HF0182": {
      "nome": "Psicologia Social do Trabalho e das Organizações I",
      "ementa": "Caracterização da categoria trabalho. Implicações do conceito de trabalho na estruturação social e na construção subjetiva. Transformações do mundo laboral e psicologia. Análise do impacto das abordagens organizacionais na compreensão das diferentes formas de inserção laboral",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Teorias e Práticas em Psicologia Social II (HF0164)"],
    },
    "HF0190": {
      "nome": "Pesquisa em Psicologia",
      "ementa": "Fases da elaboração de um projeto de pesquisa científica em Psicologia: Pergunta de partida, Exploração, Problemática e Construção do modelo de análise. Projeto de pesquisa. Fases de execução de uma pesquisa científica em Psicologia: Coleta de dados, Análise das informações e Conclusões. Comunicação da pesquisa científica em Psicologia",
      "carga": "96 hrs",
      "creditos": "06",
      "pre": ["Métodos e Técnicas de Pesquisa quantitativa em Psicologia(HF0163)" , "Métodos e Técnicas de Pesquisa Qualitativa em Psicologia (HF0170)"],
    },
    "HF0186": {
      "nome": "Psicologia Escolar/Educacional I",
      "ementa": "História da educação no Brasil. Políticas públicas no campo da educação. Participação da Psicologia no campo da Educação. Análise das modalidades teórico-metodológicas da práxis entre Psicologia, Sociedade e Pedagogia. A atuação do psicólogo no campo educacional. A formação numa perspectiva interdisciplinar. Questões éticas",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Psicologia do Desenvolvimento II (HF0 167)" , "Teorias e Práticas em Psicologia Social I (HF0158)"],
    },
    "HF0187": {
      "nome": "Métodos Clínicos de Avaliação Cognitiva",
      "ementa": "O método clínico na avaliação cognitiva: histórico e bases teóricas. Abordagem piagetiana acerca da inteligência e sua investigação. Abordagem histórico-cultural na investigação das funções cognitivas. A Orientação Profissional numa perspectiva clínica e sócio-histórica.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Psicometria (HF0173)"],
    },
    "HF0188": {
      "nome": "Psicologia aplicada aos Portadores de Necessidades Especiais",
      "ementa": "Portadores de necessidades especiais: conceitos e classificações. Tipos de necessidades especiais. Etiologias e sua prevenção. Alternativas de atendimento psico-educacionais. Inserção e permanência no mercado de trabalho.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Psicologia do Desenvolvimento II (HF0 167)"],
    },
    "HF0196": {
      "nome": "Psicopatologia Infanto-Juvenil",
      "ementa": "Psicopatologia infanto-juvenil: aspectos históricos, epistemológicos e clínicos. Perspectivas diagnósticas e tendências atuais.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Fundamentos de Psicopatologia (HF0 176)"],
    },
  },
  
  "7": {
    "HF0183": {
      "nome": "Psicologia e Saúde Coletiva II - ÊNFASE SAÚDE",
      "ementa": "Articulação da inserção e da prática do psicólogo na saúde pública, enfocando noções referentes à atenção e educação em saúde e suas estratégias de implementação. Construção da prática interdisciplinar na saúde.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Psicologia e Saúde Coletiva I (HF0178)"],
    },
    "HF0185": {
      "nome": "Teorias e práticas em Psicologia Social III - ÊNFASE SOCIAL",
      "ementa": "Cenário Social do Brasil Contemporâneo. O Estado e as Políticas Públicas. Cidadania, Direitos e Políticas Públicas. As Diversificadas Dimensões das Políticas Públicas. O Processo de Exclusão e de Inclusão Social. Psicologia e Políticas Públicas. Espaços e Dinâmicas Sociais de Atuação da Psicologia Social.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Teorias e práticas em Psicologia Social II (HF0164)" , "Psicologia Comunitária (HF0171)"],
    },
    "HF0189": {
      "nome": "Psicologia Social do Trabalho e das Organizações II",
      "ementa": "A Psicologia como ciência e prática nas organizações. Principais subsistemas organizacionais e perspectivas de atuação no âmbito da Psicologia Social do Trabalho e das Organizações.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Psicologia Social do Trabalho e das Organizações I (HF0182)"],
    },
    "HF0191": {
      "nome": "Psicologia Escolar/Educacional II - ÊNFASE SOCIAL",
      "ementa": "Cotidiano escolar/ educacional e os modos de subjetivação contemporâneos. Relações interpessoais, grupais, intergrupais e institucionais presentes no contexto educacional. Novos rumos da Psicologia Escolar/educacional no cotidiano educacional brasileiro contemporâneo.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Psicologia Escolar/Educacional I (HF0186)"],
    },
    "HF0192": {
      "nome": "Métodos Projetivos de Avaliação",
      "ementa": "Conceito de Projeção. Os principais testes projetivos, suas características gerais, contribuições e importância na avaliação psicológica.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Psicometria (HF0173)"],
    },
    "HF0225": {
      "nome": "Fundamentos de Psicopatologia",
      "ementa": "MÓDULO I - A perspectiva fenomenológica em Psicologia e os conceitos de normal e patológico. Diferentes escolas em Psicopatologia Fenomenológica: ACP, Gestalt, Psicodrama e tendências atuais. Perspectivas diagnósticas e estudos de caso; MÓDULO II - A concepção de normal e patológico em Freud. As negações constitutivas do ser: Recalque, Denegação, Desmentido e Foraclusão. Estruturas clínicas: Neurose, Psicose e Perversão. Estudo de casos clínicos; MÓDULO III - Noção de normalidade e patologia na perspectiva da análise do comportamento. A concepção de funcionalidade versus causalidade para a abordagem psicopatológica. Diagnóstico comportamental. Análise dos processos comportamentais envolvidos nos principais quadros psicopatológicos.",
      "carga": "96 hrs",
      "creditos": "06",
      "pre": ["Introdução a Psicologia (HF0155)"],
    },
  },

  "8": {
    "HF0197": {
      "nome": "TTP I: Fenomenologia Existencial e Humanismo - ÊNFASE SAÚDE",
      "ementa": "Bases teóricas das abordagens fenomenológico-existenciais: a abordagem centrada na pessoa e a Gestalt-terapia; objetivos terapêuticos, contrato, vínculo terapêutico; o papel da técnica; condução do processo, mudança terapêutica e encerramento.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Epistemologia e História das Psicologias I (HF0181)"],
    },
    "HF0199": {
      "nome": "TTP II: Psicanálise - ÊNFASE SAÚDE",
      "ementa": "Psicanálise e universidade: a inserção da psicanálise na clínica escola. O método de associação livre e atenção flutuante. As entrevistas preliminares. Concepção e função do diagnóstico em psicanálise. A transferência e a repetição. O lugar do analista na condução do tratamento. Os desvios da práxis e a contribuições de Jacques Lacan à clínica psicanalítica. Casos clínicos. A supervisão.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Epistemologia e História das Psicologias II (HF0175)"],
    },
    "HF0198": {
      "nome": "TTP III: Comportamental - ÊNFASE SAÚDE",
      "ementa": "O modelo de Análise Funcional do Comportamento. Comportamento modelado por contingências X governado por regras. A entrevista comportamental. A investigação dos comportamentos encobertos. O emprego de técnicas de modificação do comportamento: procedimentos, adequação e ética. Elaboração e execução de programas de atuação terapêutica. Acompanhamento terapêutico. Medicina comportamental e novas possibilidades de atuação preventiva.",
      "carga": "64 hrs",
      "creditos": "04",
      "pre": ["Análise Experimental do Comportamento (HF0180)"],
    },
    "HF0200": {
      "nome": "Psicologia Social do Trabalho e das Organizações III - ÊNFASE SOCIAL",
      "ementa": "Os sentidos do trabalho na contemporaneidade; a relação entre trabalho e saúde, com enfoque especial na saúde mental; compreensão das formas de expressão do sofrimento psíquico no trabalho; abordagens teóricas acerca da questão saúde mental e trabalho.",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Psicologia Social do Trabalho e das Organizações II (HF0189)"],
    },
    "HF0105": {
      "nome": "Psicodiagnóstico - ÊNFASE SAÚDE",
      "ementa": "Histórico do psicodiagnóstico. Conceito. Perspectivas teóricas. Processo psicodiagnóstico – técnicas e instrumentos. Psicodiagnóstico nas diferentes faixas etárias. Laudo psicológico. Processo de encaminhamento. Aplicação do psicodiagnóstico nas diversas áreas da Psicologia. Implicações sociais do psicodiagnóstico",
      "carga": "48 hrs",
      "creditos": "03",
      "pre": ["Métodos Projetivos de Avaliação (HF0192)"]
    },
  },

  "9": {
    "-----": {
      "nome": "Estágios Obrigatórios I e II na ênfase: Processos Psicossociais e Construção da Realidade",
      "ementa": "Prática supervisionada de planejamento e intervenção em grupos, instituições, organizações e comunidades, segundo diferentes orientações teóricas e metodológicas. Reflexões e discussões sobre a formação do psicólogo e sua inserção profissional",
      "carga": "432 hrs",
      "creditos": "27",
      "pre": ["Práticas Integrativas II (HF0179)" , "Psicologia Escolar/Educacional II(HF0191)" , "Teorias e Práticas em Psicologia Social III (HF0185)" , "Psicologia Social do Trabalho e das Organizações III (HF0200)"],
    },
    "------": {
      "nome": "Estágios Obrigatórios I e II na ênfase: Processos Clínicos e Atenção à Saúde",
      "ementa": "Prática supervisionada de planejamento e intervenção em processos clínicos e de atenção à saúde em diferentes orientações teóricas e metodológicas. Reflexões e discussões sobre a formação do psicólogo e sua inserção profissional.",
      "carga": "432 hrs",
      "creditos": "27",
      "pre": ["Práticas Integrativas II (HF0179)" , "Saúde Coletiva II (HF0183)" , "TTP I(HF0197), II (HF0198) ou III (HF0199)" , "Psicodiagnóstico (HF0105)"],
    },
  },

  "10": {
    "-----": {
      "nome": "Estágios Obrigatórios I e II na ênfase: Processos Psicossociais e Construção da Realidade",
      "ementa": "Prática supervisionada de planejamento e intervenção em grupos, instituições, organizações e comunidades, segundo diferentes orientações teóricas e metodológicas. Reflexões e discussões sobre a formação do psicólogo e sua inserção profissional",
      "carga": "432 hrs",
      "creditos": "27",
      "pre": ["Práticas Integrativas II (HF0179)" , "Psicologia Escolar/Educacional II(HF0191)" , "Teorias e Práticas em Psicologia Social III (HF0185)" , "Psicologia Social do Trabalho e das Organizações III (HF0200)"],
    },
    "------": {
      "nome": "Estágios Obrigatórios I e II na ênfase: Processos Clínicos e Atenção à Saúde",
      "ementa": "Prática supervisionada de planejamento e intervenção em processos clínicos e de atenção à saúde em diferentes orientações teóricas e metodológicas. Reflexões e discussões sobre a formação do psicólogo e sua inserção profissional.",
      "carga": "432 hrs",
      "creditos": "27",
      "pre": ["Práticas Integrativas II (HF0179)" , "Saúde Coletiva II (HF0183)" , "TTP I(HF0197), II (HF0198) ou III (HF0199)" , "Psicodiagnóstico (HF0105)"],
    },
  },
}
